In [2]:
import pandas as pd
import numpy as np

In [48]:
#Assign it to a variable 
url = 'C:\\Users\\makbulhussain.k\\Downloads\\03filtering'   
data = pd.read_csv(url, sep = '\t')

In [49]:
data.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [7]:
data.tail()

,order_id,quantity,item_name,choice_description,item_price
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [8]:
data.shape

(4622, 5)

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
order_id              4622 non-null int64
quantity              4622 non-null int64
item_name             4622 non-null object
choice_description    3376 non-null object
item_price            4622 non-null object
dtypes: int64(2), object(3)
memory usage: 180.6+ KB

In [10]:
data.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [11]:
data.index

RangeIndex(start=0, stop=4622, step=1)

In [12]:
data.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

In [41]:
# clean the item_price column and transform it in a float
prices = [float(value[1 : -1]) for value in data.item_price]

In [50]:
data.item_price.head()

0     $2.39
1     $3.39
2     $3.39
3     $2.39
4    $16.98
Name: item_price, dtype: object

In [51]:
# reassign the column with the cleaned prices
data.item_price = prices

In [53]:
data.item_price.head()

0     2.39
1     3.39
2     3.39
3     2.39
4    16.98
Name: item_price, dtype: float64

In [18]:
# delete the duplicates in item_name and quantity
data_filtered = data.drop_duplicates(['item_name','quantity'])

In [54]:
# select only the products with quantity equals to 1
data_one_prod = data_filtered[data_filtered.quantity == 1]

In [55]:
data_one_prod.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",10.98

In [79]:
# delete the duplicates in item_name and quantity
data_filtered = data.drop_duplicates(['item_name','quantity'])

# select only the products with quantity equals to 1
data_one_prod = data_filtered[data_filtered.quantity == 1]

# select only the item_name and item_price columns
price_per_item = data_one_prod[['item_name', 'item_price']]

# sort the values from the most to less expensive
price_per_item.sort_values(by = "item_price", ascending = False).head(5)

                  item_name  item_price
606        Steak Salad Bowl       11.89
1229    Barbacoa Salad Bowl       11.89
1132    Carnitas Salad Bowl       11.89
7             Steak Burrito       11.75
168   Barbacoa Crispy Tacos       11.75

In [78]:
#sort by name
data.sort_values(by = "item_name").head()

      order_id  quantity          item_name choice_description  item_price
3389      1360         2  6 Pack Soft Drink        [Diet Coke]       12.98
341        148         1  6 Pack Soft Drink        [Diet Coke]        6.49
1849       749         1  6 Pack Soft Drink             [Coke]        6.49
1860       754         1  6 Pack Soft Drink        [Diet Coke]        6.49
2713      1076         1  6 Pack Soft Drink             [Coke]        6.49

In [56]:
data_one_prod[data_one_prod['item_price']>10].item_name.nunique()

12

In [66]:
#What was the quantity of the most expensive item ordered?¶
data.sort_values(by = "item_price", ascending = False).head(4)

,order_id,quantity,item_name,choice_description,item_price
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,44.25
3480,1398,3,Carnitas Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",35.25
1254,511,4,Chicken Burrito,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",35.00
3602,1443,4,Chicken Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",35.00

In [75]:
#How many times people orderd more than one Canned Soda
data_drink_steak_bowl = data[(data.item_name == "Canned Soda") & (data.quantity > 1)]
len(data_drink_steak_bowl)

20

In [86]:
##How many times were a Veggie Salad Bowl ordered?
data_salad_number = data[data.item_name == "Veggie Salad Bowl"]
len(data_salad_number)
#data_salad_number.sort_values(by = "item_price", ascending = False).head(8)
#data_salad_number = data[data.item_name == "Veggie Salad Bowl"].nunique()
#data_salad_number

18

In [21]:
#get the size of each quantity
d = data.groupby('quantity').size()
d.head()

quantity
1    4355
2     224
3      28
4      10
5       1
dtype: int64

In [22]:
data.quantity.nunique()

9

In [23]:
data.quantity.value_counts().head()

1     4355
2      224
3       28
4       10
15       1
Name: quantity, dtype: int64

In [24]:
data.describe()

          order_id     quantity   item_price
count  4622.000000  4622.000000  4622.000000
mean    927.254868     1.075725     7.464336
std     528.890796     0.410186     4.245557
min       1.000000     1.000000     1.090000
25%     477.250000     1.000000     3.390000
50%     926.000000     1.000000     8.750000
75%    1393.000000     1.000000     9.250000
max    1834.000000    15.000000    44.250000

In [25]:
data.describe(include = "all")

           order_id     quantity     item_name choice_description   item_price
count   4622.000000  4622.000000          4622               3376  4622.000000
unique          NaN          NaN            50               1043          NaN
top             NaN          NaN  Chicken Bowl        [Diet Coke]          NaN
freq            NaN          NaN           726                134          NaN
mean     927.254868     1.075725           NaN                NaN     7.464336
std      528.890796     0.410186           NaN                NaN     4.245557
min        1.000000     1.000000           NaN                NaN     1.090000
25%      477.250000     1.000000           NaN                NaN     3.390000
50%      926.000000     1.000000           NaN                NaN     8.750000
75%     1393.000000     1.000000           NaN                NaN     9.250000
max     1834.000000    15.000000           NaN                NaN    44.250000

In [34]:
data.item_price.describe()

count    4622.000000
mean        7.464336
std         4.245557
min         1.090000
25%         3.390000
50%         8.750000
75%         9.250000
max        44.250000
Name: item_price, dtype: float64

In [29]:
round(data.item_price.mean())

7

In [35]:
data.quantity.value_counts().tail() #7, 10, 11, 66 and 73 years -> only 1 occurrence

15    1
7     1
10    1
5     1
8     1
Name: quantity, dtype: int64